In [1]:
import pandas as pd
import os
from sqlalchemy import create_engine
from keys import password
import time
import datetime

In [2]:
weather_csv = 'data_sets/Summary of Weather.csv'
wwii_data_thor = 'data_sets/thor_wwii_data_clean.csv'
wwii_data_aircraft = 'data_sets/thor_wwii_aircraft_gloss.csv'
wwii_data_weapons = 'data_sets/thor_wwii_weapon_gloss.csv'

In [3]:
weather_df = pd.read_csv(weather_csv)
weather_df.head()
weather_df

,STA,Date,Precip,WindGustSpd,MaxTemp,MinTemp,MeanTemp,Snowfall,PoorWeather,YR,...,FB,FTI,ITH,PGT,TSHDSBRSGF,SD3,RHX,RHN,RVG,WTE
0,10001,1942-7-1,1.016,NaN,25.555556,22.222222,23.888889,0,NaN,42,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,10001,1942-7-2,0,NaN,28.888889,21.666667,25.555556,0,NaN,42,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,10001,1942-7-3,2.54,NaN,26.111111,22.222222,24.444444,0,NaN,42,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,10001,1942-7-4,2.54,NaN,26.666667,22.222222,24.444444,0,NaN,42,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,10001,1942-7-5,0,NaN,26.666667,21.666667,24.444444,0,NaN,42,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
119035,82506,1945-12-27,0,NaN,28.333333,18.333333,23.333333,0,NaN,45,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119036,82506,1945-12-28,9.906,NaN,29.444444,18.333333,23.888889,0,1,45,...,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,NaN
119037,82506,1945-12-29,0,NaN,28.333333,18.333333,23.333333,0,1,45,...,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,NaN
119038,82506,1945-12-30,0,NaN,28.333333,18.333333,23.333333,0,NaN,45,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119039,82506,1945-12-31,0,NaN,29.444444,17.222222,23.333333,0,NaN,45,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
thor_df = pd.read_csv(wwii_data_thor)
thor_df.head()

,wwii_id,master_index_number,msndate,theater,naf,country_flying_mission,tgt_country_code,tgt_country,tgt_location,tgt_type,...,callsign,rounds_ammo,spares_return_ac,wx_fail_ac,mech_fail_ac,misc_fail_ac,target_comment,mission_comments,source,database_edit_comments
0,1,NaN,1943-08-15,MTO,12 AF,USA,13.0,ITALY,SPADAFORA,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,4285,20028.0,1945-02-20,PTO,5 AF,USA,NaN,PHILIPPINE ISLANDS,PUERTA PRINCESA,UNIDENTIFIED TARGET,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,NaN,1943-08-15,MTO,12 AF,USA,13.0,ITALY,COSENZA,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,NaN,1943-08-15,MTO,12 AF,USA,13.0,ITALY,GIOJA TAURO,NaN,...,NaN,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN,NaN
4,8167,14639.0,1945-02-23,PTO,5 AF,USA,NaN,PHILIPPINE ISLANDS,BALETE PASS,WOODED AREA,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
thor_df.columns

Index([&#39;wwii_id&#39;, &#39;master_index_number&#39;, &#39;msndate&#39;, &#39;theater&#39;, &#39;naf&#39;,
       &#39;country_flying_mission&#39;, &#39;tgt_country_code&#39;, &#39;tgt_country&#39;,
       &#39;tgt_location&#39;, &#39;tgt_type&#39;, &#39;tgt_id&#39;, &#39;tgt_industry_code&#39;,
       &#39;tgt_industry&#39;, &#39;source_latitude&#39;, &#39;source_longitude&#39;, &#39;latitude&#39;,
       &#39;longitude&#39;, &#39;unit_id&#39;, &#39;mds&#39;, &#39;aircraft_name&#39;, &#39;msn_type&#39;,
       &#39;tgt_priority&#39;, &#39;tgt_priority_explanation&#39;, &#39;ac_attacking&#39;, &#39;altitude&#39;,
       &#39;altitude_feet&#39;, &#39;number_of_he&#39;, &#39;type_of_he&#39;, &#39;lbs_he&#39;, &#39;tons_of_he&#39;,
       &#39;number_of_ic&#39;, &#39;type_of_ic&#39;, &#39;lbs_ic&#39;, &#39;tons_of_ic&#39;, &#39;number_of_frag&#39;,
       &#39;type_of_frag&#39;, &#39;lbs_frag&#39;, &#39;tons_of_frag&#39;, &#39;total_lbs&#39;, &#39;total_tons&#39;,
       &#39;takeoff_base&#39;, &#39;takeoff_country&#39;, &#39;takeoff_latitude&#39;,
       &#39;takeoff_longitude&#39;, &#39;ac_lost&#39;, &#39;ac_damaged&#39;, &#39;ac_airborne&#39;,
       &#39;ac_dropping&#39;, &#39;time_over_target&#39;, &#39;sighting_method_code&#39;,
       &#39;sighting_explanation&#39;, &#39;bda&#39;, &#39;callsign&#39;, &#39;rounds_ammo&#39;,
       &#39;spares_return_ac&#39;, &#39;wx_fail_ac&#39;, &#39;mech_fail_ac&#39;, &#39;misc_fail_ac&#39;,
       &#39;target_comment&#39;, &#39;mission_comments&#39;, &#39;source&#39;,
       &#39;database_edit_comments&#39;],
      dtype=&#39;object&#39;)

In [6]:
thor_df2 = thor_df[['latitude','longitude','msndate']].copy()

In [7]:
weather_df2 = weather_df[['Date', 'MaxTemp', 'MinTemp','MAX', 'MIN']].copy()

In [8]:
weather_date_series = weather_df2['Date'] = pd.to_datetime(weather_df2['Date'])
weather_df2

             Date    MaxTemp    MinTemp   MAX   MIN
0      1942-07-01  25.555556  22.222222  78.0  72.0
1      1942-07-02  28.888889  21.666667  84.0  71.0
2      1942-07-03  26.111111  22.222222  79.0  72.0
3      1942-07-04  26.666667  22.222222  80.0  72.0
4      1942-07-05  26.666667  21.666667  80.0  71.0
...           ...        ...        ...   ...   ...
119035 1945-12-27  28.333333  18.333333  83.0  65.0
119036 1945-12-28  29.444444  18.333333  85.0  65.0
119037 1945-12-29  28.333333  18.333333  83.0  65.0
119038 1945-12-30  28.333333  18.333333  83.0  65.0
119039 1945-12-31  29.444444  17.222222  85.0  63.0

[119040 rows x 5 columns]

In [9]:
thor_df2['msndate'] = pd.to_datetime(thor_df2['msndate'])
thor_df2

         latitude   longitude    msndate
0       38.220000   15.370000 1943-08-15
1        9.750000  118.750000 1945-02-20
2       39.270000   16.250000 1943-08-15
3       38.430000   15.900000 1943-08-15
4       16.083333  120.916667 1945-02-23
...           ...         ...        ...
178276  -8.472085  148.234293 1942-12-14
178277   4.883333   38.083333 1940-09-18
178278  -8.471111  126.458333 1942-11-17
178279  -2.583333  150.833333 1945-02-16
178280  -9.050000  124.533333 1942-06-11

[178281 rows x 3 columns]

In [10]:
weather_df2 = weather_df2.rename(columns= {"Date":'dates','MAX':'maxtempf','MIN':'mintempf', 'MaxTemp': 'maxtempc', 'MinTemp': 'mintempc'})

In [14]:
weather_df2

            dates   maxtempc   mintempc  maxtempf  mintempf
0      1942-07-01  25.555556  22.222222      78.0      72.0
1      1942-07-02  28.888889  21.666667      84.0      71.0
2      1942-07-03  26.111111  22.222222      79.0      72.0
3      1942-07-04  26.666667  22.222222      80.0      72.0
4      1942-07-05  26.666667  21.666667      80.0      71.0
...           ...        ...        ...       ...       ...
119035 1945-12-27  28.333333  18.333333      83.0      65.0
119036 1945-12-28  29.444444  18.333333      85.0      65.0
119037 1945-12-29  28.333333  18.333333      83.0      65.0
119038 1945-12-30  28.333333  18.333333      83.0      65.0
119039 1945-12-31  29.444444  17.222222      85.0      63.0

[119040 rows x 5 columns]

In [23]:
# engine = create_engine(f'postgresql://postgres:{password}@localhost:5433/WWII')
# conn = engine.connect()
# # thor_df2.to_sql('locations', con= conn)
# weather_df2.to_sql('weather', con= conn)

# data = engine.execute('''create table combined_table as
# select w.dates, w.maxtempc, w.mintempc, w.maxtempf, w.mintempf, l.latitude, l.longitude
# from weather as w
# join locations as l
# on w.dates = l.msndate''')